import '../model/Article.dart';

var newarticles = [
  Article(
    title: 'ЛИЧНЫЙ КАБИНЕТ',
    text:
        '''Личный кабинет обучающегося ЮФУ представляет его цифровой профиль. Личный кабинет имеет несколько разделов. Доступ к нему можно получить, нажав на ссылку регистрации и указав фамилию и паспортные данные. При регистрации рекомендуется загрузить фотографию, т.к. именно она будет изображена на банковской карте - электронном пропуске. За данные, находящиеся в личном кабинете, каждый обучающийся несет персональную ответственность.
        ЗАПИСЬ  - страница со всеми возможными вариативными предметами, выбором модулей МУАМ и НАМ, подачей заявки на общежитие, подача заявки в Институт военного обучения, а также на образовательные смены на Базах практик и спортивно-оздоровительного туризма университета
        ПРОФИЛЬ - страница с информацией о месте обучения, ссылкой на расписание занятий,ссылкой на запись на иностранный язык, а также контакты в социальных сетях (по желанию)
        ПОРТФОЛИО  - страница для загрузки достижений обучающихся, которые впоследствии используются в университетских конкурсах (конкурс на ПГАС, конкурс на улучшение жилищных условий, "Студент года" и др)
        РЕЗУЛЬТАТЫ ОСВОЕНИЯ ОБРАЗОВАТЕЛЬНОЙ ПРОГРАММЫ - страница с успеваемостью студента за весь период обучения в университете
        КОНКУРСЫ - страница со всеми внутриуниверситетскими конкурсами
        ПОМОЩЬ  - страница с инструкцией по устранению ошибок в личном кабинете''',
    image1: 'assets/images/lk.jpg',
    image2: 'assets/images/stipendii.jpg',
  ),
  Article(
    title: 'БРС',
    text:
        ''' БАЛЬНО-РЕЙТИНГОВАЯ СИСТЕМА используется для поэтапного оценивания уровня освоения образовательной программы студентов
        Для получения допуска к экзамену студент должен заработать в течение семестра 38 баллов - минимальное пороговое значение
        Для дисциплин? по которым предусмотрен зачет, пороговое значение  - 60 баллов
        Преподаватель может начислить студенту дополнительные (бонусные) баллы за проявление академической активности в ходе изучения дисциплины, выполнение индивидуальных заданий, активное участие в групповой работе
        ТЕКУЩИЙ КОНТРОЛЬ  - контроль всех видов работ обучающихся в ходе освоения дисциплины
        РУБЕЖНЫЙ КОНТРОЛЬ  - проверка полноты знаний и умений по материалу части дисциплины (модуля)
        ИТОГОВЫЙ РЕЙТИНГ - сумма баллов, набранных в течение семестра, включая промежуточную аттестацию
        Посмотреть свои результаты возможно через электронный сервис БРС''',
    image1: 'assets/images/marks.jpg',
    image2: 'assets/images/brs.jpg',
  ),
  Article(
    title: 'ПРОМЕЖУТОЧНАЯ АТТЕСТАЦИЯ',
    text:
        ''' Промежуточная аттестация  - она же сессия. Может проводиться как в устной, так и в письменной форме. Получить информацию о своей успеваемости можно в "Личном кабинете" в разделе "Результаты освоения образовательной программы"
        Формы оценки знаний:
        - экзамен
        - зачет
        - дифференцируемый зачет (зачет/незачет + оценка в соответствии с баллами)
        - защита курсовой работы
        - отчет по научно-исследовательской работе
        - иная отчетность в соотвествии с учебным планом
        Студент может пройти промежуточную аттестацию по предмету не в установленный срок при наличии уважительной причины и подтверждающего документа
        По результату сессии, при условии оценок только "4" и "5" и всеми зачетами, студенту, обучающемуся за счет бюджетных ассигнований, назначается академическая стипендия''',
    image1: 'assets/images/study.jpg',
    image2: 'assets/images/stipendii.jpg',
  ),
  Article(
    title: 'УЧЕБНЫЙ ГОД',
    text:
        ''' Учебный год в университете начинается с 1 сентября для очной и очно-заочной форм обучения делится на 2 семестра.
        В каждом семестре проводятся Недели академической мобильности - мероприятия учебной направленности во всех структурных подразделениях для посещения любыми студентами
        Занятия первой смены начинаются в 8.00.
        Одно занятие  - 2 академических часа.
        Перерыв после первого занятия - 15 минут, после второго  - 30 минут.
        ''',
    image1: 'assets/images/stipendii.jpg',
    image2: 'assets/images/brs.jpg',
  ),
  Article(
    title: 'ПРАВА И ОБЯЗАННОСТИ СТУДЕНТА',
    text: '''  
    Обучающимся предоставляются академические права в различным областях
        ''',
    image1: 'assets/images/prava.jpg',
    image2: 'assets/images/stipendii.jpg',
  ),
  Article(
    title: 'АКАДЕМИЧЕСКИЙ ОТПУСК',
    text:
        ''' АКАДЕМИЧЕСКИЙ ОТПУСК - это отпуск, который предоставляется обучающемуся в связи с невозможностью освоения образовательной программы в университете по медицинским показаниям, семейным или иным обстоятельствам на период времени, не превышающий двух лет.
        Основаниями для предоставления академического отпуска являются:
        - Состояние здоровья,
        - Призыв на военную службу,
        - Семейные или иные обстоятельства (болезнь члена семьи, за которым нужен уход, стихийные бедствия и т.п.)
        - Уважительная производственная причина (для студентов очно-заочной и заочной формы обучения)
        Академический отпуск предоставляется неограниченное количество раз.
        ''',
    image1: 'assets/images/otpusk.jpg',
    image2: 'assets/images/brs.jpg',
  ),
];
